import React from 'react';
import CustomText from './customText';

const PrivPolRUiOS = () => {
  return <CustomText>
    ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ ПЕРСРОНАЛЬНЫХ ДАННЫХ
    1. ОБЩИЕ ПОЛОЖЕНИЯ
        1.1. Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, размещенной в мобильном приложении MuTools (далее - Приложение), которую третьи лица могут получить о пользователе во время использования Приложения. Использование Приложения означает безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней условиями обработки персональных данных (персональная информация), в случае несогласия с этими условиями Пользователь должен воздержаться от использования Приложения, его сервисов и услуг. Общество с ограниченной ответственностью «Мартин Урал» является оператором Приложения (далее - Оператор).
        1.2. В рамках настоящей Политики под персональными данными (персональной информацией) Пользователя понимаются:
            • персональная информация, которую Пользователь предоставляет о себе самостоятельно при авторизации в Приложении или в процессе использования Приложения, включая персональные данные, которые могут быть получены Оператором при авторизации Пользователем при скачивании Приложения через сервисы App Store. Обязательная для предоставления информация помечена специальным образом. Иная информация предоставляется Пользователем на его усмотрение.
            • данные, которые автоматически передаются сервисам Приложения в процессе их использования с помощью установленного на устройстве пользователя программного обеспечения, в том числе IP-адрес, данные файлов cookie, информацию о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к сервисам), технические характеристики оборудования и программного обеспечения, используемые Пользователем. Дата и время доступа к сервисам, адреса запрашиваемых страниц и иная подобная информация.
        1.3. Настоящая Политика применяется только к Приложению. Приложение не контролирует и не несет ответственности за сайты и мобильные приложения третьих лиц, на которые Пользователь может перейти по ссылкам, доступным в Приложении.

    2. ЦЕЛЬ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ
        2.1. Отношения, связанные со сбором, хранением, распространением и защитой информации предоставляемой Пользователем, регулируются настоящей Политикой, иными локальными документами Оператора и действующим законодательством Российской Федерации.
        2.2. Целью настоящей Политики является обеспечение защиты и сохранности информации о Пользователях, в том числе их персональных данных, от несанкционированного доступа и разглашения.
        2.3. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы в Приложении и включают в себя следующую информацию: - контактный телефон Пользователя; - адрес электронной почты (e-mail); Заполняя регистрационную форму, Пользователь выражает свое полное согласие с условиями настоящей Политики.
        2.4. Скачивая и устанавливая приложение, принимая данное положение о Политике конфиденциальности, Пользователь выражает свое полное согласие для использования приложением доступа:
            • к камере Пользователя с целью сканирования QR-кодов универсальных передаточных документов, маршрутных листов и доверенностей;
            • к контактам Пользователя с целью добавления или изменения контактов сотрудников Оператора в соответствии с программой «Битрикс24»; 
            • к геолокации Пользователя с целью добавления адресов торговых точек.
        2.5. Пользователь при заполнении регистрационной формы подтверждает, что:
            • указывает достоверную информацию о себе, вся иная информация предоставляется Пользователем по его собственному усмотрению.
            • ознакомлен с настоящей Политикой, выражает свое согласие с ней.
            Ознакомление с условиями настоящей Политики и проставление галочки под ссылкой на данную Политику является письменным согласием Пользователя на сбор, хранение, обработку персональных данных, предоставляемых Пользователем.

    3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПРЕДОСТАВЛЕННОЙ ПОЛЬЗОВАТЕЛЕМ
        3.1. В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц. При использовании отдельных сервисов Пользователь соглашается с тем, что определенная часть его персональной информации становится общедоступной. 
        3.2. Приложение вправе передавать персональную информацию Пользователя третьим лицам в следующих случаях:
            - Пользователь выразил согласие на такие действия;
            - Передача необходима для использования Пользователем определенного сервиса или исполнения определенного соглашения с Пользователем;
            - Передача персональных данных Пользователя предусмотрена в рамках действующего законодательства Российской Федерации;
            - в случае отчуждения Приложения к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации.
        3.3. Обработка персональных данных Пользователя осуществляется без ограничения срока любым законным способом, в том числе в информационных системах с использованием средств автоматизации или без использования таких средств.
        3.4. Оператор Приложения принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.
        3.5. При утрате или разглашении персональных данных Оператор Приложения информирует Пользователя утрате или разглашении персональных данных.
 
    4. УДАЛЕНИЕ И ИЗМЕНЕНИЕ ДАННЫХ
        4.1. Персональные данные пользователя хранятся на сервере Оператора Приложения на территории Российской Федерации
        4.2. Пользователь обязан предоставить информацию о персональных данных, необходимых для пользования Приложением.
        4.3. Пользователь может обновлять, дополнять предоставленную информацию о персональных данных в случае изменения данной информации.
        4.4. Оператор не проверяет достоверность получаемой (собираемой) информации о Пользователях, за исключением случаев, когда такая проверка необходима в целях исполнения обязательств перед Пользователем.
        4.5. Оператор Приложения обязан удалить аккаунт и персональные данные пользователя с момента обращения или запроса Пользователя на электронную почту Оператора it@martinural.ru с указанием почты или номера аккаунта.
        4.6. Оператор Приложения обязан осуществить блокирование персональных данных, относящихся к конкретному пользователю, с момента обращения или запроса Пользователя или его законного представителя.

    5. ОТВЕТСТВЕННОСТЬ СТОРОН
        5.1. Оператор Приложения, не исполнивший свои обязательства, несет ответственность за убытки, понесенные пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации.
        5.2. В случае утраты или разглашения конфиденциальной информации Оператор Приложения не несет ответственности, если данная конфиденциальная информация:
            - стала публичным достоянием до ее утраты или разглашения.
            - была получена от третьей стороны до момента ее получения администрацией Приложения.
            - была разглашена с согласия Пользователя.
    6. РАЗРЕШЕНИЕ СПОРОВ
        6.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Оператором, обязательным является соблюдение претензионного порядка регулирования спора.
        6.2. Получатель претензии в течение 10 дней с момента получения претензии письменно уведомляет заявителя претензии о результатах рассмотрения претензии.
        6.3. При недостижении соглашения спор будет передан на рассмотрение в суд в соответствии с действующим законодательством РФ.
        6.4. К настоящей Политике и отношениям между Пользователем и Оператором, возникающим в связи с применением Политики конфиденциальности, подлежит применению право Российской Федерации.

    7. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
        7.1. Оператор Приложения вправе вносить изменения в настоящую Политику конфиденциальности без согласия пользователя.
        7.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения в Приложении, если иное не предусмотрено новой редакцией Политики конфиденциальности.
        7.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать по адресу: t.me/MartinUBot
        7.4. Действующая Политика конфиденциальности размещена на странице по  адресу https://bitrix24.martinural.ru/~6dUPr



  </CustomText>
};

export default PrivPolRUiOS;
